30

In [5]:
def add(x, y):
    return x + y

print(add(10,11)

SyntaxError: incomplete input (689037963.py, line 5)

In [6]:
def add(x,y):
    return x + y
print(add(10,11))

21

In [8]:
a = [1,2,3,4]

for i in a:
    print(i, end=' ')

1 2 3 4

In [9]:
a.append(5)
a

[1, 2, 3, 4, 5]

In [10]:
a.insert(1,10) #특정 위치에 삽입
a

[1, 10, 2, 3, 4, 5]

In [12]:
a.pop() #마지막요소
a

[1, 10, 2, 3]

In [13]:
a.remove(3) # 특정요소 삭제
a

[1, 10, 2]

In [15]:
sum(a)

13

In [16]:
dic = {'대원':13, '혜수':9}
dic

{'대원': 13, '혜수': 9}

In [17]:
dic['혜수']

9

In [18]:
dic['진'] = 14 #딕셔너리 요소 추가
dic

{'대원': 13, '혜수': 9, '진': 14}

## pandas 라이브러리 포함
### Series와 DAtaFrame클래스가 제공됨
####'#'의 개수가 적을수록 글꼴 크기가 크다.
### Series - 1차원 벡터 데이터에 행방향 인덱스를 붙인것
### DataFrame -2차원 행과 열의 형태로 표현되는 것

In [21]:
import pandas as pd

#리스트를 사용해서 Series 생성
data = [1, 2, 3, 4, 5]
s = pd.Series(data)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
# 딕셔너리를 이용한 Series 생성
dic = {'100':'남','101':'여','102':'','103':'남'}
gender = pd.Series(dic)
gender

100    남
101    여
102
103    남
dtype: object

In [26]:
name = pd.Series({'100':'이산하','101':'강하늘','102':'김산','103':'안전해'})
name

100    이산하
101    강하늘
102     김산
103    안전해
dtype: object

In [27]:
#DataFrame 사용
회원 = pd.DataFrame({
    '회원번호':['100','101','102','103'],
    '성별':['남','여','','남'],
    '이름':['이선하','강하늘','김산','안전해']
})

회원

  회원번호 성별   이름
0  100  남  이선하
1  101  여  강하늘
2  102      김산
3  103  남  안전해

In [29]:
# 인덱스{기준을 회원번호로 설정}
회원 = pd.DataFrame({
    '회원번호':['100','101','102','103'],
    '성별':['남','여','','남'],
    '이름':['이선하','강하늘','김산','안전해']
})
회원 = 회원.set_index('회원번호')
회원

     성별   이름
회원번호
100   남  이선하
101   여  강하늘
102       김산
103   남  안전해

In [31]:
회원['이름']

회원번호
100    이선하
101    강하늘
102     김산
103    안전해
Name: 이름, dtype: object

In [32]:
회원['성별'] =='여'

회원번호
100    False
101     True
102    False
103    False
Name: 성별, dtype: bool

In [33]:
회원[회원['성별'] =='여']

     성별   이름
회원번호
101   여  강하늘

### 값 변경하기
#### loc 속성 사용-(location),(위치)-row 이름, 칼럼이름
#### iloc 속성 - integer location(정수위치) [0][1]

In [35]:
회원.loc['102']['이름'] = '송중기'
회원

     성별   이름
회원번호
100   남  이선하
101   여  강하늘
102      송중기
103   남  안전해

회원.iloc[2][0] = '남'
회원

## CSV파일로 저장하기
### csv(comma seperated value)-쉼표로 구분된 값
### pandas에 제공되는 함수 - to_csv() : 파일생성(쓰기)
### read_csv() : 파일읽기

In [39]:
회원.to_csv("./datas/회원명부.csv")

In [40]:
회원 = pd.read_csv("./datas/회원명부.csv")
회원

   회원번호 성별   이름
0   100  남  이선하
1   101  여  강하늘
2   102  남  송중기
3   103  남  안전해